rorke-time/experiment1-sriov-rorke-time/rorke200-memtier-50k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         4702.34          ---          ---         1.06837         0.98300         2.92700         6.04700       316.32 
Gets        47016.46     18806.79     28209.67         1.03330         0.95900         2.60700         5.82300      2260.97 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      51718.79     18806.79     28209.67         1.03649         0.96700         2.63900         5.85500      2577.29 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.071        0.000
SET       0.431        5.000
SET       0.543       10.000
SET       0.623       15.000
SET       0.687       20.000
SET       0.743       25.000
SET       0.791       30.000
SET       0.831       35.000
SET       0.879       40.000
SET       0.927       45.000
SET       0.983       50.000
SET       1.007       52.500
SET       1.039       55.000
SET       1.071       57.500
SET       1.095       60.000
SET       1.127       62.500
SET       1.159       65.000
SET       1.191       67.500
SET       1.215       70.000
SET       1.247       72.500
SET       1.287       75.000
SET       1.303       76.250
SET       1.327       77.500
SET       1.343       78.750
SET       1.367       80.000
SET       1.391       81.250
SET       1.415       82.500
SET       1.447       83.750
SET       1.471       85.000
SET       1.511       86.250
SET       1.543       87.500
SET       1.559       88.125
SET       1.583       88.750
SET       1.607       89.375
SET       1.631       90.000
SET       1.655       90.625
SET       1.679       91.250
SET       1.711       91.875
SET       1.751       92.500
SET       1.791       93.125
SET       1.831       93.750
SET       1.855       94.062
SET       1.871       94.375
SET       1.903       94.688
SET       1.935       95.000
SET       1.959       95.312
SET       1.999       95.625
SET       2.039       95.938
SET       2.079       96.250
SET       2.127       96.562
SET       2.175       96.875
SET       2.207       97.031
SET       2.239       97.188
SET       2.271       97.344
SET       2.303       97.500
SET       2.335       97.656
SET       2.367       97.812
SET       2.431       97.969
SET       2.479       98.125
SET       2.527       98.281
SET       2.591       98.438
SET       2.623       98.516
SET       2.655       98.594
SET       2.719       98.672
SET       2.751       98.750
SET       2.799       98.828
SET       2.847       98.906
SET       2.911       98.984
SET       2.991       99.062
SET       3.071       99.141
SET       3.183       99.219
SET       3.231       99.258
SET       3.311       99.297
SET       3.359       99.336
SET       3.439       99.375
SET       3.519       99.414
SET       3.615       99.453
SET       3.727       99.492
SET       3.839       99.531
SET       3.967       99.570
SET       4.159       99.609
SET       4.255       99.629
SET       4.319       99.648
SET       4.447       99.668
SET       4.543       99.688
SET       4.671       99.707
SET       4.767       99.727
SET       4.895       99.746
SET       4.991       99.766
SET       5.119       99.785
SET       5.247       99.805
SET       5.343       99.814
SET       5.375       99.824
SET       5.439       99.834
SET       5.535       99.844
SET       5.599       99.854
SET       5.695       99.863
SET       5.791       99.873
SET       5.855       99.883
SET       5.951       99.893
SET       6.079       99.902
SET       6.143       99.907
SET       6.207       99.912
SET       6.271       99.917
SET       6.335       99.922
SET       6.463       99.927
SET       6.527       99.932
SET       6.655       99.937
SET       6.911       99.941
SET       7.263       99.946
SET       7.647       99.951
SET       7.743       99.954
SET       7.935       99.956
SET       8.063       99.958
SET       8.095       99.961
SET       8.255       99.963
SET       8.319       99.966
SET       8.447       99.968
SET       8.511       99.971
SET       8.703       99.973
SET       8.959       99.976
SET       9.087       99.977
SET       9.279       99.978
SET       9.279       99.979
SET       9.471       99.980
SET       9.599       99.982
SET       9.663       99.983
SET       9.855       99.984
SET       9.919       99.985
SET       9.983       99.987
SET      10.111       99.988
SET      10.239       99.988
SET      10.303       99.989
SET      10.303       99.990
SET      10.367       99.990
SET      10.431       99.991
SET      10.495       99.991
SET      10.623       99.992
SET      10.623       99.993
SET      10.623       99.993
SET      10.815       99.994
SET      10.815       99.994
SET      10.815       99.995
SET      10.815       99.995
SET      10.879       99.995
SET      10.879       99.995
SET      10.943       99.996
SET      10.943       99.996
SET      11.007       99.996
SET      11.007       99.997
SET      11.007       99.997
SET      11.263       99.997
SET      11.263       99.997
SET      11.263       99.997
SET      11.263       99.998
SET      11.263       99.998
SET      11.327       99.998
SET      11.327       99.998
SET      11.327       99.998
[...]
SET      11.711       99.999
SET      11.711      100.000
---
GET       0.055        0.000
GET       0.415        5.000
GET       0.519       10.000
GET       0.599       15.000
GET       0.671       20.000
GET       0.727       25.000
GET       0.775       30.000
GET       0.815       35.000
GET       0.863       40.000
GET       0.911       45.000
GET       0.959       50.000
GET       0.991       52.500
GET       1.023       55.000
GET       1.047       57.500
GET       1.079       60.000
GET       1.111       62.500
GET       1.143       65.000
GET       1.167       67.500
GET       1.199       70.000
GET       1.231       72.500
GET       1.263       75.000
GET       1.279       76.250
GET       1.295       77.500
GET       1.319       78.750
GET       1.335       80.000
GET       1.359       81.250
GET       1.383       82.500
GET       1.407       83.750
GET       1.431       85.000
GET       1.463       86.250
GET       1.495       87.500
GET       1.511       88.125
GET       1.527       88.750
GET       1.551       89.375
GET       1.567       90.000
GET       1.591       90.625
GET       1.615       91.250
GET       1.639       91.875
GET       1.663       92.500
GET       1.695       93.125
GET       1.727       93.750
GET       1.743       94.062
GET       1.767       94.375
GET       1.783       94.688
GET       1.807       95.000
GET       1.831       95.312
GET       1.855       95.625
GET       1.887       95.938
GET       1.919       96.250
GET       1.959       96.562
GET       1.999       96.875
GET       2.023       97.031
GET       2.039       97.188
GET       2.079       97.344
GET       2.095       97.500
GET       2.127       97.656
GET       2.159       97.812
GET       2.191       97.969
GET       2.239       98.125
GET       2.271       98.281
GET       2.335       98.438
GET       2.351       98.516
GET       2.383       98.594
GET       2.415       98.672
GET       2.463       98.750
GET       2.495       98.828
GET       2.543       98.906
GET       2.591       98.984
GET       2.639       99.062
GET       2.703       99.141
GET       2.799       99.219
GET       2.847       99.258
GET       2.895       99.297
GET       2.959       99.336
GET       3.039       99.375
GET       3.119       99.414
GET       3.215       99.453
GET       3.343       99.492
GET       3.487       99.531
GET       3.663       99.570
GET       3.855       99.609
GET       3.967       99.629
GET       4.079       99.648
GET       4.223       99.668
GET       4.351       99.688
GET       4.447       99.707
GET       4.575       99.727
GET       4.735       99.746
GET       4.831       99.766
GET       4.991       99.785
GET       5.119       99.805
GET       5.183       99.814
GET       5.247       99.824
GET       5.311       99.834
GET       5.407       99.844
GET       5.471       99.854
GET       5.535       99.863
GET       5.631       99.873
GET       5.695       99.883
GET       5.759       99.893
GET       5.855       99.902
GET       5.887       99.907
GET       5.951       99.912
GET       6.015       99.917
GET       6.047       99.922
GET       6.111       99.927
GET       6.175       99.932
GET       6.239       99.937
GET       6.303       99.941
GET       6.399       99.946
GET       6.463       99.951
GET       6.495       99.954
GET       6.527       99.956
GET       6.591       99.958
GET       6.655       99.961
GET       6.751       99.963
GET       6.815       99.966
GET       6.975       99.968
GET       7.231       99.971
GET       7.551       99.973
GET       7.903       99.976
GET       8.031       99.977
GET       8.255       99.978
GET       8.383       99.979
GET       8.575       99.980
GET       8.767       99.982
GET       9.023       99.983
GET       9.151       99.984
GET       9.471       99.985
GET       9.599       99.987
GET       9.919       99.988
GET       9.919       99.988
GET      10.047       99.989
GET      10.175       99.990
GET      10.303       99.990
GET      10.367       99.991
GET      10.431       99.991
GET      10.495       99.992
GET      10.623       99.993
GET      10.751       99.993
GET      10.815       99.994
GET      10.879       99.994
GET      10.879       99.995
GET      11.007       99.995
GET      11.071       99.995
GET      11.071       99.995
GET      11.199       99.996
GET      11.263       99.996
GET      11.327       99.996
GET      11.391       99.997
GET      11.455       99.997
GET      11.519       99.997
GET      11.519       99.997
GET      11.519       99.997
GET      11.647       99.998
GET      11.647       99.998
GET      11.711       99.998
GET      11.775       99.998
GET      11.839       99.998
GET      11.839       99.998
GET      11.903       99.998
GET      11.967       99.999
GET      11.967       99.999
GET      12.031       99.999
GET      12.031       99.999
GET      12.031       99.999
[...]
GET      12.095       99.999
GET      12.159       99.999
GET      12.159       99.999
GET      12.223       99.999
GET      12.223       99.999
GET      12.223       99.999
GET      12.287       99.999
GET      12.287       99.999
GET      12.287       99.999
[...]
GET      12.287      100.000
GET      12.287      100.000
GET      12.351      100.000
GET      12.351      100.000
GET      12.415      100.000
GET      12.415      100.000
GET      12.415      100.000
[...]
GET      12.479      100.000
GET      12.479      100.000
GET      12.479      100.000
[...]
GET      12.543      100.000
GET      12.543      100.000
GET      12.543      100.000
[...]
GET      12.671      100.000
GET      12.671      100.000
---
WAIT      0.000      100.000